Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
densenet169 (Model)          (None, 1664)              12642880
_________________________________________________________________
dense (Dense)                (None, 1024)              1704960
_________________________________________________________________
batch_normalization (BatchNo (None, 1024)              4096
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0
_________________________________________________________________
dense_1 (Dense)              (None, 10)                10250
=================================================================
Total params: 14,362,186
Trainable params: 1,717,258
Non-trainable params: 12,644,928
_________________________________________________________________